[
  {
    "id": "personalPortfolio",
    "title": "Personal Portfolio",
    "imageSource": "/images/personalPortfolio.png",
    "imageCaption": "Personal Portfolio Home Page",
    "description": "Seeking to leverage my burgeoning skills in React.js, I embarked on a journey to create a personal portfolio – a practical application that would not only showcase my previous projects but also serve as an immersive platform for hands-on coding experience. What better way to consolidate my learning than by crafting a tangible representation of my abilities?\n \nInitially, my intention was to focus on the fundamentals of web development: HTML, CSS, and JavaScript. However, a recent encounter with a React.js tutorial sparked a new idea. Why not seize this opportunity to implement the freshly acquired React.js knowledge? The allure lay in React's capacity to construct reusable components and foster interactivity without necessitating full-page reloads.",
    "developmentProcess": "My endeavor commenced with a preliminary sketch, outlining the proposed layout of the portfolio website and its constituent components – menu, footer, contact page, projects page, and sub-components. This visual blueprint formed the foundation, guiding my React component selection. Eager to explore different design approaches, I scoured other developers' portfolios online, identifying common patterns that could inform my own project's aesthetics.\n \nTransitioning to actual development, I set up the React project locally for iterative testing. I systematically matched each component of my personal portfolio with the previously outlined list. My journey unveiled the power of React Router, enabling URL updates via link clicks without full page reloads. This technique transformed the user experience into that of a seamless single-page application.\n \nAs the project evolved, I cultivated my understanding of React concepts and delved into ancillary topics, notably React Router. Striving for a visually appealing and user-friendly interface, I opted to utilize Bootstrap for styling, granting me the liberty to concentrate on front-end logic – the very skillset I sought to refine.\n \nThe culmination of development marked a pivotal juncture – the decision to host the portfolio. Here, GitHub emerged as a dual-purpose solution: not only could it serve as a code repository, but it also facilitated website hosting.",
    "myRole": "In the capacity of both developer and designer, I wielded my expertise in front-end logic and user interface design. Bootstrap was embraced for its time-saving capabilities, enabling me to concentrate on honing my front-end skills. Through this endeavor, I transcended passive learning, utilizing practical application to absorb a multitude of React concepts, including the advanced terrain of React Router.\n \nThe portfolio project metamorphosed into an engaging laboratory, where my knowledge was tested and refined. It transcended the boundaries of tutorial-based instruction, challenging me to innovate, problem-solve, and bridge theoretical understanding with practical execution. This journey underscored the transformative power of hands-on coding, solidifying my prowess in React.js, reinforcing design principles, and bolstering my proficiency in creating dynamic user experiences.",
    "technologies": [
      "React",
      "React Router",
      "Bootstrap",
      "Javascript",
      "HTML",
      "CSS",
      "Github"
    ],
    "links": [
      { "githubPages": "https://emanuel2258.github.io/personal-portfolio/" },
      { "githubRepo": "https://github.com/emanuel2258/personal-portfolio" }
    ]
  },
  {
    "id": "splitwiseProject",
    "title": "Splitwise Project",
    "imageSource": "/images/splitWise.png",
    "imageCaption": "Splitwise Script After running it",
    "description": "Embarking on a personal project aimed at streamlining expense splitting with my husband has proven to be an insightful journey. Through the careful development of a Python script, I've managed to create a seamless system that effortlessly handles our financial transactions. To kickstart this endeavor, I initiated a comprehensive online search to determine the feasibility of integrating my project with Splitwise. I was delighted to discover that Splitwise offers a public API accessible at \"https://dev.splitwise.com/\". The existence of this API served as a pivotal turning point, igniting my enthusiasm to proceed further.",
    "developmentProcess": "Diving into the API's documentation, I began a meticulous exploration of its endpoints using Postman. My primary goal was to ascertain the accuracy of my calls, understanding the requisite parameters, and deciphering the corresponding responses. This initial groundwork not only provided me with crucial insights but also boosted my confidence in executing these API calls effectively. Visualizing the entire project's flow became the next logical step. Armed with a clear understanding of the data's journey from extraction to upload, I crafted a comprehensive diagram outlining each stage. This visualization became my guiding blueprint, ensuring a systematic and organized development process. As the project evolved, my focus shifted towards embracing object-oriented programming principles. I delineated the key classes required for the project's success. A master class encapsulated the overarching process, while an expenses class skillfully filtered, computed, and formatted data. The final piece of the puzzle was the Splitwise class, acting as the bridge to facilitate seamless interactions with the Splitwise API. Armed with a well-structured plan, I proceeded to bring my vision to life. The Python script I developed not only uploaded transactions to Splitwise but also generated a CSV for meticulous review. This additional layer of transparency enabled me to confidently monitor and validate each interaction with Splitwise.",
    "myRole": "This project, beyond its functional utility, was an immersive learning experience. Through hands-on Python development, I deepened my familiarity with the language, mastering its nuances while also honing my skills in handling CSV files and gracefully managing errors. The process of integrating third-party APIs, like Splitwise's, into my project not only expanded my technical prowess but also underscored the importance of meticulous documentation and strategic testing.\n \nIn retrospect, this project perfectly exemplifies how combining practicality with passion can lead to powerful and enriching learning experiences. Not only have I succeeded in creating a time-saving solution for managing expenses, but I've also fortified my expertise in Python, API integration, and project design. This endeavor serves as a testament to the endless possibilities that personal projects can offer in terms of skill enhancement and practical application.",
    "technologies": ["Python", "Splitwise API", "CSV", "Javascript", "Github"],
    "links": [{ "githubRepo": "https://github.com/emanuel2258/SplitWiseProject" }]
  },
  {
    "id": "availabilityReport",
    "title": "Availability Report",
    "imageSource": "/images/AvailabilityCalculations.png",
    "imageCaption": "Availability Monthly View of Different Components",
    "description": "The core of this project involved creating a Python program designed to retrieve monitor statuses from our customer-facing environments. These statuses would then be sent to a platform capable of calculating the availability percentage over a specified time span, going back up to a year.\n \nIn the context of my support team's responsibilities, we extensively utilize the Customer Communication Console (CCC), an IBM tool encompassing various functions including customer status pages, availability monitoring, and other features essential to our roles. The aim of this project was to leverage the existing CCC tool to visualize monitor availability in our customer-facing environments.",
    "developmentProcess": "To embark on this endeavor, I initially had to familiarize myself with the tools at hand. This involved comprehending the available API endpoints and availability tracking capabilities within the CCC tool, as well as understanding the functionality and data exposed by our monitoring tool, IBM Cloud Synthetics.\n \nOnce I had a clear grasp of each tool's capabilities, the challenge lay in establishing a connection between them. Given that these tools lacked any intrinsic integration, I had to devise a mapping strategy. This entailed mapping the disparate structures they employed, such as monitors, monitor IDs, policies, rules, etc., to determine how to extract and synchronize data effectively.\n \nOne particularly intricate aspect was the mapping of IBM Cloud Synthetics' monitors to the CCC tool, which required crafting the necessary dashboards to accommodate the SLA metrics. Delving into the minutiae of the API requests, both from CCC and IBM Cloud Synthetics, became imperative to orchestrate seamless data flow.\n \nThe subsequent steps involved iteratively filtering, processing, and formatting the data from each tool before forwarding it to CCC. These Python scripts were then integrated into a Jenkins job, automating the process to run at specific intervals, ensuring the latest IBM Cloud Synthetics data is relayed to CCC.\n \nThe development journey encompassed several rounds of iteration. With each iteration, I refined the codebase, tested extensively, and redeployed changes to GitHub, fine-tuning the system to ensure accuracy and reliability.",
    "myRole": "Although I was relatively new to Python, my familiarity with object-oriented programming provided a solid foundation for this endeavor. I embraced Python's capabilities, utilizing libraries like HTTP requests for seamless communication. Extensive string manipulation and regular expressions played a pivotal role, especially in handling diverse naming conventions across alerts from different teams.\n \nDespite this being my first complete project involving Python, I successfully navigated its intricacies. I also delved into new libraries and tools, enhancing my skill set. Notably, the project deepened my experience with IBM Cloud Synthetics, offered insights into setting up Jenkins jobs for automation, and exposed me to API endpoints from two IBM products.\n \nIn conclusion, this project embodies the fusion of technical exploration and practical application. By capitalizing on existing tools and technologies, I not only contributed to enhancing our support team's efficiency but also honed my Python proficiency, API integration expertise, and problem-solving skills. The project stands as a testament to the transformative potential of tackling complex challenges through thoughtful development and persistent iteration.",
    "technologies": [
      "Python",
      "CCC (IBM Tool)",
      "Jenkins",
      "Github",
      "IBM Cloud Synthetics"
    ],
    "links": []
  },
  {
    "id": "IRB",
    "title": "Institutional Review Board Online Form System",
    "imageSource": "/images/IRB.png",
    "imageCaption": "IRB's Board dashboard preview",
    "description": "At the University of Puerto Rico at Mayaguez (UPRM), the Institutional Review Board (IRB) Office serves as the official gateway for researchers seeking approval for human subjects' involvement in their projects. The current paper-based submission system has led to issues related to space, finances, and communication inefficiencies. With an onus on optimizing the process and minimizing paper dependency, our capstone project was conceived. We aimed to develop a web application facilitating streamlined project submissions, renewals, modifications, and enhanced communication between UPRM researchers and the IRB Office.",
    "developmentProcess": "Our journey commenced with engaging the project's stakeholders to deeply understand their workflow and pain points. Building upon these insights, we compiled a comprehensive list of requirements. This initial framework was refined through iterative interactions with the users, ensuring alignment with their needs and expectations. Translating the requirements into a tangible vision, we proceeded to create graphical mock-ups using a sketching application. Collaborative discussions with stakeholders enriched these mock-ups, paving the way for modifications that reflected their feedback.\n \nWith a clear vision in place, the project transitioned to the technical implementation phase. The development was strategically divided into three pivotal stages: design, system establishment, and full implementation.\n \nThe design phase encompassed conceptualizing the entire system, followed by an implementation of a skeletal framework with limited functionality. This preliminary framework allowed us to verify the effectiveness of chosen technologies and functionalities on the server early in the development cycle.\n \nSubsequently, the full implementation phase unfolded. Gradually, we augmented the rudimentary framework, progressively incorporating features until all the predefined system requirements were seamlessly met.",
    "myRole": "In this project, my primary focus was on front-end logic and user interface design. Marking my initial experience working with a client, the journey was filled with challenges and learning opportunities. Despite the hurdles, it remains one of my proudest accomplishments, deeply cherished alongside my team members.\n \nA significant portion of my responsibilities encompassed Angular.js, JavaScript, HTML, and CSS. It marked my first significant exposure to front-end development, especially within the context of a substantial project aimed at external use.\n \nThe amalgamation of technical growth and client collaboration truly made this endeavor exceptional. While I encountered various complexities, I embraced the learning curve wholeheartedly. This project not only enriched my front-end expertise but also bolstered my confidence in contributing effectively to client-driven projects.\n \nIn retrospect, the project's successful execution and tangible impact underscored the value of collaborative development and the transformative power of digital solutions in real-world scenarios.",
    "technologies": [
      "Angular JS",
      "Javascript",
      "HTML",
      "CSS",
      "Bootstrap",
      "Laravel",
      "MariaDB"
    ],
    "links": []
  },
  {
    "id": "JIFT",
    "title": "JIFT",
    "imageSource": "/images/JIFT.png",
    "imageCaption": "JIFT's Home Page",
    "description": "This project stands as a cornerstone within our support team, serving as an indispensable tool forged both by and for us. Designed to unravel the intricacies of customer issues, it's a debugging juggernaut. Beyond that, its capabilities extend to automating time-consuming tasks and facilitating interactions with various support team tools, including our status page. Java emerged as the primary language of choice, a realm I had previously traversed during my college years.\n \nThe inception of this tool traced back to a team member who laid its foundational functionality. I opted to contribute, stepping in as backup support and taking charge of coding additional features.",
    "developmentProcess": "My involvement unfurled with collaborative sessions, absorbing insights into the existing framework and code architecture. This understanding laid the groundwork for my gradual integration into the project. I began by making incremental enhancements like supplementing our suite of tests.\n \nAs my comfort grew, I transitioned to larger-scale modifications. I embarked on refining the codebase, proposing structural improvements, and augmenting the functionality. Notably, I introduced a comprehensive test suite for another supported product, Control Tower.\n \nFurthermore, I embarked on integrating the tool with our status page, utilizing API endpoints for seamless connectivity to the Customer Communication Console (CCC).\n \nOur codebase thrived within GitHub, fostering collaboration through rigorous peer reviews preceding each code push. Rigorous testing practices were adopted, encompassing end-user testing and rigorous unit testing protocols.\n \nMy primary focus lay in extending functionalities. I diligently engineered tests for existing products and seamlessly incorporated new products like SCIS. Additionally, I undertook the responsibility of adapting our code to accommodate changes in third-party services, such as CCC and endpoints in Transparent Supply.",
    "myRole": "My contributions primarily encompassed bolstering functionalities and ensuring robust testing. This entailed creating an expansive suite of tests for diverse products and orchestrating integrations with external services. I orchestrated comprehensive unit testing and spearheaded efforts to maintain code coherence through successive updates in various tools.\n \nThis project transcended individual coding prowess, instilling a deep understanding of Java's application within a corporate ecosystem. Collaborating on an established codebase with compliance demands illuminated the intricacies of professional collaboration and aligned development practices.\n \nTo this day, my engagement with this project continues. My contributions have not only fortified the tool's capabilities but also enriched my comprehension of corporate software development dynamics, emphasizing teamwork, adaptability, and the longevity of impactful projects within organizational workflows.",
    "technologies": ["Java", "Maven", "Github"],
    "links": []
  }
]
